0/inner_pipe/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/metal";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    
    outer_face

    {
        type            externalWallHeatFluxTemperature;
 
        mode            coefficient;
 
        Ta              uniform 800.0;
        h               uniform 100.0;
        thicknessLayers ( 0.003);
        kappaLayers ( 50 );
        kappaMethod     solidThermo;
 
        value           $internalField;
    }
    
    strut_face

    {
        
       type            zeroGradient;



    }
    inlet_pipe

    {
        type            zeroGradient;


    }
    outlet_pipe

    {
        type            zeroGradient;
    }
     
        inner_face
    {
        
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     solidThermo;
        kappa           kappa;
        value           uniform 300;  
 }
}


// ************************************************************************* //
