0/inner_pipe/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    outer_face
    {
        type            calculated;
        value           $internalField;
    }
    inlet_pipe
    {
        type            calculated;
  
        value           $internalField;

    
    }
    outlet_pipe
    {
        type            calculated;
  
        value           $internalField;

    
    }

    inner_face
    {
        
        type            calculated;
  
        value           $internalField;

    }
     strut_face
    {
        
        type            calculated;
  
        value           $internalField;

    }


}


// ************************************************************************* //
