0/water/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1.466e-07;;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.466e-07;;
    }

    outlet
    {
        type            calculated;
        value           uniform 1.466e-07;;
    }


    water_wall
    {
        type            compressible::alphatWallFunction;
        

        value           uniform 1.466e-07;
    }

}


// ************************************************************************* //
