0/water/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 855e-9;

boundaryField
{
    water_wall
    {
        type            calculated;
	value		uniform 855e-9;
    }
    inlet
    {
        type            calculated;
        value           uniform 855e-9;
    }
    outlet
    {
       type            calculated;
        value           uniform 855e-9;


    }
   
}


// ************************************************************************* //
