0/water/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/water";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.2428;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.2428;
    }
    outlet
    {
        type            zeroGradient;
            }
   
    water_wall
    {
        type            omegaWallFunction;
       value           uniform 0.2428;
    }
}


// ************************************************************************* //
