system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2312
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

regionSolvers
{
    water           fluid;
    inner_pipe     solid;
    
}

startFrom       startTime;

startTime       0	;

stopAt          endTime;

endTime         20000;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

maxCo           0.8;

maxDi 100; //This limits the diffusity going higher than 100
adjustTimeStep  yes;
functions
{

wallHeatFlux1
{
    // Mandatory entries (unmodifiable)
    type            wallHeatFlux;
    libs            ("libfieldFunctionObjects.so");

    // Optional entries (runtime modifiable)
    patches     ("water_wall"); // (wall1 "(wall2|wall3)");
    qr          qr;

    // Optional (inherited) entries
    writePrecision  8;
    writeToFile     true;
    useUserTime     true;
    region          water;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         2000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   100;
}

}




// ************************************************************************* //
