system/water/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/water";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
  
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss upwind;
   
    div(phi,e)          Gauss upwind;
    div(phi,K)          Gauss upwind;
    div(phi,(p|rho))    Gauss upwind;
    div(phi,k)          Gauss upwind;
    div(phi,omega)    Gauss upwind;
    div(phi,h)        Gauss upwind;
    div(phi,p)        Gauss upwind;
    div(phiv,p)        Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
wallDist
{
	method meshWave;
}


// ************************************************************************* //
